In [ ]:
"""Find all employees wjo are not managers with their dept_no, emp_no, and salary"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `dept_emp` ; 
drop table if exists  `dept_manager` ; 
drop table if exists  `employees` ; 
drop table if exists  `salaries` ; 

CREATE TABLE `dept_emp` (
`emp_no` int(11) NOT NULL,
`dept_no` char(4) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));

CREATE TABLE `dept_manager` (
`dept_no` char(4) NOT NULL,
`emp_no` int(11) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));

CREATE TABLE `employees` (
`emp_no` int(11) NOT NULL,
`birth_date` date NOT NULL,
`first_name` varchar(14) NOT NULL,
`last_name` varchar(16) NOT NULL,
`gender` char(1) NOT NULL,
`hire_date` date NOT NULL,
PRIMARY KEY (`emp_no`));

CREATE TABLE `salaries` (
`emp_no` int(11) NOT NULL,
`salary` int(11) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`from_date`));

INSERT INTO dept_emp VALUES(10001,'d001','1986-06-26','9999-01-01');
INSERT INTO dept_emp VALUES(10002,'d001','1996-08-03','9999-01-01');

INSERT INTO dept_manager VALUES('d001',10002,'1996-08-03','9999-01-01');

INSERT INTO employees VALUES(10001,'1953-09-02','Georgi','Facello','M','1986-06-26');
INSERT INTO employees VALUES(10002,'1964-06-02','Bezalel','Simmel','F','1996-08-03');

INSERT INTO salaries VALUES(10001,88958,'1986-06-26','9999-01-01');
INSERT INTO salaries VALUES(10002,72527,'1996-08-03','9999-01-01');

In [ ]:
"""SQL solution"""
# 1
SELECT de.dept_no, de.emp_no, s.salary
FROM dept_emp AS de
INNER JOIN salaries AS s
ON de.emp_no = s.emp_no
WHERE de.emp_no NOT IN (SELECT emp_no FROM dept_manager)

# 2
SELECT de.dept_no, de.emp_no, s.salary
FROM dept_emp AS de, salaries AS s
WHERE de.emp_no = s.emp_no
AND de.emp_no NOT IN (SELECT emp_no FROM dept_manager)

In [2]:
"""pandas dataframe creation"""
import numpy as np
import pandas as pd

# this task requires only 3 tables, table employees is not necessary
t_dept_emp = np.array([[10001,'d001','1986-06-26','9999-01-01'],
                       [10002,'d001','1996-08-03','9999-01-01']])
t_sal = np.array([[10001,88958,'1986-06-26','9999-01-01'],
                  [10002,72527,'1996-08-03','9999-01-01']])

dept_emp = pd.DataFrame(data=t_dept_emp, columns=['emp_no', 'dept_no', 'from_date', 'to_date'])
salaries = pd.DataFrame(data=t_sal, columns=['emp_no', 'salary', 'from_date', 'to_date'])
dept_manager = pd.DataFrame(data=[['d001',10002,'1996-08-03','9999-01-01']], columns=['dept_no', 'emp_no', 'from_date', 'to_date'])
dept_emp.head()

  emp_no dept_no   from_date     to_date
0  10001    d001  1986-06-26  9999-01-01
1  10002    d001  1996-08-03  9999-01-01

In [3]:
dept_manager.head()

  dept_no  emp_no   from_date     to_date
0    d001   10002  1996-08-03  9999-01-01

In [4]:
salaries.head()

  emp_no salary   from_date     to_date
0  10001  88958  1986-06-26  9999-01-01
1  10002  72527  1996-08-03  9999-01-01

In [15]:
# find each employee with their salary and emp_no of their manager
# then compare emp_no and emp_no_manager to find employees who aare not managers
df = pd.merge(dept_emp[['emp_no', 'dept_no']], salaries[['emp_no', 'salary']], on='emp_no', how='inner')
df = pd.merge(df, dept_manager[['dept_no', 'emp_no']], on=['dept_no'], how='outer', suffixes=['','_manager'])
df

  emp_no dept_no salary  emp_no_manager
0  10001    d001  88958           10002
1  10002    d001  72527           10002

In [16]:
df.dtypes

emp_no            object
dept_no           object
salary            object
emp_no_manager     int64
dtype: object

In [19]:
# set the dtypes same for comparison
df['emp_no'] = df['emp_no'].astype('int64')
df[df['emp_no'] != df['emp_no_manager']][['dept_no', 'emp_no', 'salary']]

  dept_no  emp_no salary
0    d001   10001  88958